from telegram_bot.utils import StatesUsers

# СООБЩЕНИЯ ОТ БОТА
start_message_1 = """Уважаемый клиент приветсвуем в ARAGON SHOP 
Ознакомится с нашими правилами и ассотритемтом и акциями вы можете по данной ссылке  https://telegra.ph/-07-21-1775
С любовью Ваш ARAGON SHOP ❤️🖤"""
start_message_2 = """✨ВАС ПРИВЕТСТВУЕТ✨
    🦅 OREL & RESHKA🦅

🏆✓ТОПОВЫЙ СЕРВИС✓ 🏆
  🥇№ 1 в вашем городе 🥇

🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟

🧨УБОЙНЫЕ PAV ВЕЩЕСТВА
💣 ЛУЧШИЕ ВАРЩИКИ РФ и СНГ
🧨НАДЕЖНЫЕ КЛАДЫ
💣ШУСТРЫЙ СЕРВИС 
🧨УДОБНАЯ ЛОКАЦИЯ

👍 ТЕХНИЧЕСКАЯ ПОДДЕРЖКА 24/7

⛱ ПЕРИОДИЧЕСКИЕ АКЦИИ И КОНКУРСЫ

♻️ НАКОПИТЕЛЬНЫЕ ПЕРСОНАЛЬНЫЕ СКИДКИ

💥💥💥💥💥💥💥💥💥💥💥💥

Выберите раздел

📦 Товары и цены
Жми 👉 /products
- - - - - - - - - - - - - - - -
🌆 Выбрать район
Жми 👉 /locations
- - - - - - - - - - - - - - - -
💰 Мой последний заказ
Жми 👉 /last_order"""
start_message_3 = """🤟 - 🤟 - 🤟 - 🤟 - 🤟 - 🤟 - 🤟 - 🤟 - 🤟 - 🤟 - 🤟
Рады приветствовать Вас в магазине

🔥🔥🔥 " Т У С И Н А Р У С И " 🔥🔥🔥

🤙 - 🤙 - 🤙 - 🤙 - 🤙 - 🤙 - 🤙 - 🤙 - 🤙 - 🤙 - 🤙

🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺🇷🇺
ЧЕБОКСАРЫ | ЙОШКАР-ОЛА | НОВОЧЕБОКСАРСК

      🔰Работаем для ВАС — 24/7 🔰
❤️🖤НАШ ИНФО-КАНАЛ: https://t.me/+_mAlKKUUK741MGZl

🖤❤️ОТЗЫВЫ: https://t.me/+wyXJNVJWvlplODVi

❤️🖤ОПЕРАТОР: https://t.me/Tyssii_Oper_Ryssii
‼️ОПАСАЙТЕСЬ ФЕЙКОВ — внимательно сверяйте юзернейм

❇️❇️❇️ СПОСОБЫ ОПЛАТЫ: ❇️❇️❇️

💰- Оплата на карту банка
💰- TELE2
💰- EXMO-код
💰- BTC / LTC / BCH

=======================================
СДЕЛАТЬ ЗАКАЗ ТУТ

📦 Товары и цены
Жми 👉 /products

🌆 Выбрать район
Жми 👉 /locations

💰 Мой последний заказ
Жми 👉 /last_order

По вопросу трудоустройства к нам в команду обращайтесь к оператору магазина 👉👉👉💵💵💵💰"""
start_message_4 = """🌎️Карта деления Города на районы🌏️
                             📜📜📜📜📜📜📜
https://ibb.co/Ss0rv2g
                             📜📜📜📜📜📜📜

🟡🟣🟡🟣🟡🟣🟡🟣🟡🟣🟡
     ＲＥＶＯＬＵＴＩＯＮ ＳＨＯＰ
        🟡🟣🟡🟣🟡🟣🟡🟣🟡🟣🟡
    
. 🟡🟠🟡🟠🟡🟠🟡🟠🟡🟠🟡🟠🟡 К⃠А⃠Л⃠И⃠Н⃠И⃠Н⃠Г⃠Р⃠А⃠Д⃠ 
. 🟡🟠🟡🟠🟡🟠🟡🟠🟡🟠🟡🟠🟡

‼️ТОЛЬКО У НАС‼️:
   💨НИЗКИЕ ЦЕНЫ💨
      🔝ЛУЧШЕЕ КАЧЕСТВО🔝
                  ☀️СВЕЖИЕ КЛАДЫ☀️
📆ЕЖЕДНЕВНОЕ 
                                 ПОПОЛНЕНИЕ 📆
    🎱ШАНС ИСПЫТАТЬ УДАЧУ🎱
           🏆КОНКУРСЫ, ИГРЫ 🏆

💳СИСТЕМА СКИДОК💳
💳СИСТЕМА СКИДОК💳
Общий чек 10.000 - СКИДКА 1%
Общий чек 50.000 - СКИДКА 2%
Общий чек 100.000 - СКИДКА 3%
Общий чек 150.000 - СКИДКА 4%
Общий чек 200.000 - СКИДКА 5%
Общий чек 300.000 - СКИДКА 7%
Общий чек 400.000 - СКИДКА 10% (MAX)
⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️
        🛍НАШИ КОНТАКТЫ (https://t.me/+ePIiw3Dhkeg4OGRk)🛍
➖🚀➖🚀➖🚀➖🚀➖🚀➖🚀➖

 ♦️С УВАЖЕНИЕМ КОМАНДА♦️
       💠 𝐑𝐄𝐕𝐎𝐋𝐔𝐓𝐈𝐎𝐍 𝐒𝐇𝐎𝐏 💠
                       ❗️❗️❗️

Выберите раздел

📦 Товары и цены
Жми 👉 /products
- - - - - - - - - - - - - - - -
🌆 Выбрать район
Жми 👉 /locations
- - - - - - - - - - - - - - - -
💰 Мой последний заказ
Жми 👉 /last_order"""

captha_message = "Привет\nПожалуйста, решите капчу с цифрами на этом изображении, чтобы убедиться, что вы человек."

help_message_1 = """❤️❤️Уважаемый клиент, рады приветствовать вас в нашем магазине! ❤️❤️❤️
-Если у вас возникли трудности с поднятием клада или есть какие то вопросы по поводу кладов, обращайтесь к нашему оператору "ARAGON SHOP".

-Если вы хотите узнать подробнее о акциях и попасть в чаты то вам поможет наша команда админов чатов.

-Если у вас есть жалобы или пожелания, то вам к Администрации магазина.

Так же все возможные акции, игры, конкурсы вы можете узнать в разделе "АКТИВНЫЕ АКЦИЯ"
❤️❤️❤️И МНОГО ДРУГИХ АКТУАЛЬНЫХ КОНТАКТОВ У НАС В ИНФО КАНАЛЕ https://t.me/+udEm8x8nNlU3MWU0
ИЛИ НА САЙТЕ МАГАЗИНА https://aragon.click/ ❤️❤️❤️"""

help_message_2 = """Оператор : https://t.me/revoper"""
help_message_3 = """Проблемы с оплатой? Обращайтесь к оператору оплат: 
https://t.me/Tyssii_Oper_Ryssii
Помните! Чтобы оплата прошла ровно, 
оплачивайте ту сумму, которую выдал вам бот! 

Оператор магазина:
https://t.me/Tyssii_Oper_Ryssii
Остерегайтесь фэйков! 

Актуальные контакты всегда тут: https://tnr-shop.link/"""
help_message_4 = """Оператор : https://t.me/revoper"""


my_last_order_message = """<b>❗️ К сожалению,</b>
у нас нет информации о Вашем последнем заказе.

➖➖➖➖➖➖➖➖➖
Ⓜ️ Вернуться в меню
<i>Жми 👉 /menu</i>"""
my_balance_message = "Баланс: 0,00 руб"
top_up_balance_message = """Введите сумму на какую хотите пополнить баланс.

Минимальная сумма пополнения не менее %s руб"""
sure_balance_message = "Вы действительно хотите пополнить баланс на сумму %s?"

what_pay_message = "Подождите... Ваш запрос обрабатывается..."
what_pay_1_message = """❗️ Выберите способ оплаты:

💰 Оплата картой банка 👉 /up_balance_1

💰 Litecoin (LTC) 👉 /up_balance_2

💰 Bitcoin (BTC) 👉 /up_balance_3

➖➖➖➖➖➖➖➖➖➖➖
Ⓜ️ Вернуться в меню
Жми 👉 /menu"""
what_pay_2_message = """❗️ Выберите способ оплаты:

💰 Оплата на банковскую карту 👉 /up_balance_1

💰 Litecoin (LTC) 👉 /up_balance_2

💰 Bitcoin (BTC) 👉 /up_balance_3

💰 Ethereum (ETH) 👉 /up_balance_4

➖➖➖➖➖➖➖➖➖➖➖
Ⓜ️ Вернуться в меню
Жми 👉 /menu"""
what_pay_3_message = """❗️ Выберите способ оплаты:

💰 Оплата на КАРТУ (без оператора) 👉 /up_balance_1
〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
💰 Оплата ВРУЧНУЮ на КАРТУ (Через оператора) 👉 /up_balance_0
〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
💰 Litecoin (LTC) 👉 /up_balance_2
〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
💰 Bitcoin (BTC) 👉 /up_balance_3
〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
💰 Ethereum (ETH) 👉 /up_balance_4

🔹🔷🔹🔷🔹🔷🔹🔷🔹
Ⓜ️ Вернуться в меню
Жми ➡️ /menu"""
what_pay_4_message = """❗️ Выберите способ оплаты:

💰 Оплата на банковскую карту 👉 /up_balance_1

💰 Litecoin (LTC) 👉 /up_balance_2

💰 Bitcoin (BTC) 👉 /up_balance_3

➖➖➖➖➖➖➖➖➖➖➖
Ⓜ️ Вернуться в меню
Жми 👉 /menu"""

data_pay_0_message = """💰 Вы сформировали заявку на пополнение баланса на сумму %s руб.
До конца резерва осталось 60 минут.
Номер заказа: %s.
➖➖➖➖➖➖➖➖➖

Для уточнения актуальных реквизитов скопируйте и напишите оператору https://t.me/Sparrow_saller
 текст данного сообщения.

ПЕРЕД КАЖДОЙ ОПЛАТОЙ уточняйте актуальные реквизиты у оператора, во избежание потери ваших денег!

Внимание! Сообщать об оплате нужно именно оператору, а не боту!  После того, как оператор проверит оплату, адрес будет выдан в боте!

➖➖➖➖➖➖➖➖➖

🚫 Отменить заказ
Жми 👉🏿/order_cancel"""

data_pay_1_message = """Номер заказа: %s.
➖➖➖➖➖➖➖➖➖

Переведите на карту
%s
точную сумму одной транзакцией  %s руб.

➖➖➖➖➖➖➖➖➖
✔️ Проверить оплату
Жми 👉 /order_check

🚫 Отменить заказ
Жми 👉 /order_cancel"""

data_pay_2_message = """Номер заказа: %s.
➖➖➖➖➖➖➖➖➖

Переведите на адрес Litecoin:
%s
сумму %s LTC

➖➖➖➖➖➖➖➖➖
✔️ Проверить оплату
Жми 👉 /order_check

🚫 Отменить заказ
Жми 👉 /order_cancel"""

data_pay_3_message = """Номер заказа: %s.
➖➖➖➖➖➖➖➖➖

Переведите на адрес Bitcoin:
%s
сумму %s BTC

➖➖➖➖➖➖➖➖➖
✔️ Проверить оплату
Жми 👉 /order_check

🚫 Отменить заказ
Жми 👉 /order_cancel"""

data_pay_4_message = """Номер заказа: %s.
➖➖➖➖➖➖➖➖➖

Переведите на адрес Ethereum:
%s
сумму %s ETH

➖➖➖➖➖➖➖➖➖
✔️ Проверить оплату
Жми 👉 /order_check

🚫 Отменить заказ
Жми 👉 /order_cancel"""

not_pay_message = """<b>❗️ Оплата не поступила</b>
Заказ отменен!

➖➖➖➖➖➖➖➖➖
Ⓜ️ Вернуться в меню
<i>Жми 👉 /menu</i>"""

warning_pay_message = """<b>❗️ Предупреждение!</b>
Запрещено резервировать товар без оплаты более 3 раз!
У вас осталось %s попыток."""

cancel_pay_message = "Вы действительно хотите отменить заказ #%s?"
ban_pay_message = """❗<b>️ Вы забанены за заказы без оплаты!</b>
на 30 минут"""
ban_pay_data_message = """❗<b>️ ☠️ Вы забанены</b>
До конца бана осталось %s минут"""

all_products_message = """<b>Выберите товар</b>

%s
➖➖➖➖➖➖➖➖➖➖➖ 
Ⓜ️ Вернуться в меню 
Жми 👉 /menu"""
add_product_message = """<b>Вы заказываете
%s
%s</b>

Уточните город:

%s
➖➖➖➖➖➖➖➖➖➖➖
Ⓜ️ Вернуться в меню
Жми 👉 /menu"""
add_district_message = """<b>%s %s
%s</b>

❗️ Для продолжения заказа
уточните район:

<i>%s</i>
➖➖➖➖➖➖➖➖➖➖➖
Ⓜ️ Вернуться в меню
Жми 👉 /menu"""

product_pay_1_message = """❗️ Выберите способ оплаты:

💰 Оплата с баланса 👉 /buy_product_0_%s
<b>+ скидка до %a</b>

💰 Оплата картой банка 👉 /buy_product_1_%s
<b>+ скидка до %a</b>

💰 Litecoin (LTC) 👉 /buy_product_2_%s
<b>+ скидка до %a</b>

💰 Bitcoin (BTC) 👉 /buy_product_3_%s
<b>+ скидка до %a</b>

➖➖➖➖➖➖➖➖➖➖➖
Ⓜ️ Вернуться в меню
Жми 👉 /menu"""
product_pay_2_message = """❗️ Выберите способ оплаты:

💰 Оплата с баланса 👉 /buy_product_0_%s
<b>+ скидка до %a</b>

💰 Оплата на банковскую карту 👉 /buy_product_1_%s
<b>+ скидка до %a</b>

💰 Litecoin (LTC) 👉 /buy_product_2_%s
<b>+ скидка до %a</b>

💰 Bitcoin (BTC) 👉 /buy_product_3_%s
<b>+ скидка до %a</b>

💰 Ethereum (ETH) 👉 /buy_product_4_%s
<b>+ скидка до %a</b>

➖➖➖➖➖➖➖➖➖➖➖
Ⓜ️ Вернуться в меню
Жми 👉 /menu"""
product_pay_3_message = """❗️ Выберите способ оплаты:

💰 Оплата с баланса 👉 /buy_product_0_%s
<b>+ скидка до %a</b>
〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
💰 Оплата на КАРТУ (без оператора) 👉 /buy_product_1_%s
<b>+ скидка до %a</b>
〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
💰 Оплата ВРУЧНУЮ на КАРТУ (Через оператора) 👉 /up_balance_1_2
<b>+ скидка до %a</b>
〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
💰 Litecoin (LTC) 👉 /buy_product_2_%s
<b>+ скидка до %a</b>
〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
💰 Bitcoin (BTC) 👉 /buy_product_3_%s
<b>+ скидка до %a</b>
〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
💰 Ethereum (ETH) 👉 /buy_product_4_%s
<b>+ скидка до %a</b>

🔹🔷🔹🔷🔹🔷🔹🔷🔹
Ⓜ️ Вернуться в меню
Жми ➡️ /menu"""
product_pay_4_message = """❗️ Выберите способ оплаты:

💰 Оплата с баланса 👉 /buy_product_0_%s
<b>+ скидка до %a</b>

💰 Оплата на банковскую карту 👉 /buy_product_1_%s
<b>+ скидка до %a</b>

💰 Litecoin (LTC) 👉 /buy_product_2_%s
<b>+ скидка до %a</b>

💰 Bitcoin (BTC) 👉 /buy_product_3_%s
<b>+ скидка до %a</b>

➖➖➖➖➖➖➖➖➖➖➖
Ⓜ️ Вернуться в меню
Жми 👉 /menu"""
balance_pay_message = """Недостаточно средств на балансе. 
Необходимо пополнить баланс.

➖➖➖➖➖➖➖➖➖
Стоимость товара: %s
Баланс: 0,00 руб"""

buy_product_1_message = """💰 Вы заказали
%s
в районе %s.
До конца резерва осталось 60 минут.
Номер заказа: %s.
➖➖➖➖➖➖➖➖➖

Переведите на карту
%s
точную сумму одной транзакцией %s руб.

➖➖➖➖➖➖➖➖➖
✔️ Проверить оплату
Жми 👉 /order_check

🚫 Отменить заказ
Жми 👉 /order_cancel"""
buy_product_3_message = """💰 Вы заказали
%s
в районе %s.
До конца резерва осталось 60 минут.
Номер заказа: %s.
➖➖➖➖➖➖➖➖➖

Переведите на адрес <b>Bitcoin</b>:
%s
точную сумму одной транзакцией %s.

➖➖➖➖➖➖➖➖➖
✔️ Проверить оплату
Жми 👉 /order_check

🚫 Отменить заказ
Жми 👉 /order_cancel"""
buy_product_2_message = """💰 Вы заказали
%s
в районе %s.
До конца резерва осталось 60 минут.
Номер заказа: %s.
➖➖➖➖➖➖➖➖➖

Переведите на адрес <b>Litecoin</b>:
%s
точную сумму одной транзакцией %s.

➖➖➖➖➖➖➖➖➖
✔️ Проверить оплату
Жми 👉 /order_check

🚫 Отменить заказ
Жми 👉 /order_cancel"""
buy_product_4_message = """💰 Вы заказали
%s
в районе %s.
До конца резерва осталось 60 минут.
Номер заказа: %s.
➖➖➖➖➖➖➖➖➖

Переведите на адрес <b>Ethereum</b>:
%s
точную сумму одной транзакцией %s.

➖➖➖➖➖➖➖➖➖
✔️ Проверить оплату
Жми 👉 /order_check

🚫 Отменить заказ
Жми 👉 /order_cancel"""
get_city_message = """<b>Выберите район</b>

<i>%s</i>
➖➖➖➖➖➖➖➖➖➖➖
Ⓜ️ Вернуться в меню
Жми 👉 /menu"""
get_district_message = """<b>%s</b>
Уточните район:

<i>%s</i>
➖➖➖➖➖➖➖➖➖➖➖
Ⓜ️ Вернуться в меню
Жми 👉 /menu"""
get_product_message = """<b>Выберите товар</b>
в районе %s

%s
➖➖➖➖➖➖➖➖➖➖➖
Ⓜ️ Вернуться в меню
Жми 👉 /menu"""
MESSAGES = {
    "start_user_1": start_message_1,
    "start_user_2": start_message_2,
    "start_user_3": start_message_3,
    "start_user_4": start_message_4,

    "help_1": help_message_1,
    "help_2": help_message_2,
    "help_3": help_message_3,
    "help_4": help_message_4,

    "❓ Помощь_1": help_message_1,
    "❓ Помощь_2": help_message_2,
    "❓ Помощь_3": help_message_3,
    "❓ Помощь_4": help_message_4,

    "captha": captha_message,


    "💰 Мой последний заказ": my_last_order_message,
    "/last_order": my_last_order_message,

    "💰 Баланс": my_balance_message,
    "/balance": my_balance_message,

    "💰 Пополнить баланс": top_up_balance_message,
    "sure_balance": sure_balance_message,
    "what_pay": what_pay_message,

    "what_pay_1": what_pay_1_message,
    "what_pay_2": what_pay_2_message,
    "what_pay_3": what_pay_3_message,
    "what_pay_4": what_pay_4_message,

    "data_pay_0": data_pay_0_message,
    "data_pay_1": data_pay_1_message,
    "data_pay_2": data_pay_2_message,
    "data_pay_3": data_pay_3_message,
    "data_pay_4": data_pay_4_message,

    "not_pay": not_pay_message,
    "warning_pay": warning_pay_message,
    "cancel_pay": cancel_pay_message,
    "ban_pay": ban_pay_message,
    "ban_pay_data": ban_pay_data_message,

    "all_products": all_products_message,
    "add_product": add_product_message,
    "add_district": add_district_message,

    "product_pay_1": product_pay_1_message,
    "product_pay_2": product_pay_2_message,
    "product_pay_3": product_pay_3_message,
    "product_pay_4": product_pay_4_message,

    "balance_pay": balance_pay_message,
    "buy_product_1": buy_product_1_message,
    "buy_product_2": buy_product_2_message,
    "buy_product_3": buy_product_3_message,
    "buy_product_4": buy_product_4_message,


    "get_city": get_city_message,
    "get_district": get_district_message,
    "get_product": get_product_message,
}
